examples/render_all_grammars/dot/examples_StateMachine_state_machine.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40308440[ label="{StateMachine|}"]

40739384[ label="{Keyword|end\|events\|resetEvents\|state\|actions}"]

40456168[ label="{Event|+name:SMID\l+code:ID\l}"]

40474520[ label="{Command|+name:SMID\l+code:ID\l}"]

40793496[ label="{State|+name:ID\l}"]

40798440[ label="{Transition|}"]

40411864[ label="{SMID| ID}"]

40417400[ label="{Comment|\\/\\*(.\|\\n)*\?\\*\\/}"]

40575800[ label="{ID|}"]

39838344[ label="{STRING|}"]

40335048[ label="{BOOL|}"]

40480264[ label="{INT|}"]

40310440[ label="{FLOAT|}"]

40393032[ label="{STRICTFLOAT|}"]

40398568[ label="{NUMBER|}"]

40772632[ label="{BASETYPE|}"]

40778168[ label="{*OBJECT|}"]



40308440 -> 40456168[arrowtail=diamond, dir=both, headlabel="events 1..*"]
40308440 -> 40456168[headlabel="resetEvents 1..*"]
40308440 -> 40474520[arrowtail=diamond, dir=both, headlabel="commands 1..*"]
40308440 -> 40793496[arrowtail=diamond, dir=both, headlabel="states 1..*"]
40793496 -> 40474520[headlabel="actions 1..*"]
40793496 -> 40798440[arrowtail=diamond, dir=both, headlabel="transitions 1..*"]
40798440 -> 40456168[headlabel="event "]
40798440 -> 40793496[headlabel="to_state "]
40398568 -> 40393032 [dir=back]
40398568 -> 40480264 [dir=back]
40772632 -> 40398568 [dir=back]
40772632 -> 40310440 [dir=back]
40772632 -> 40335048 [dir=back]
40772632 -> 40575800 [dir=back]
40772632 -> 39838344 [dir=back]
40778168 -> 40772632 [dir=back]

}
